# DataFrame

In [2]:
import pandas as pd

l=[1,2,3,4,5,6]

var=pd.DataFrame(l)
var

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [2]:
print(type(var))

<class 'pandas.core.frame.DataFrame'>

In [5]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6]}

var1=pd.DataFrame(d)

var1

   a   s
0  1  10
1  2   9
2  3   8
3  4   7
4  5   6

In [6]:
print(type(var1))

<class 'pandas.core.frame.DataFrame'>

In [7]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6]}

var1=pd.DataFrame(d,columns=['s'])

var1

    s
0  10
1   9
2   8
3   7
4   6

In [12]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6],'d':[1,2,3,4,5]}

var1=pd.DataFrame(d)

var1['s']

0    10
1     9
2     8
3     7
4     6
Name: s, dtype: int64

In [15]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6],'d':[1,2,3,4,5], 1: [0,1,2,3,4]}

var1=pd.DataFrame(d,columns=['s',1])

var1

    s  1
0  10  0
1   9  1
2   8  2
3   7  3
4   6  4

In [16]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6],'d':[1,2,3,4,5], 1: [0,1,2,3,4]}

var1=pd.DataFrame(d,columns=['s',1], index=['a', 's', 'd', 'f', 'g'])

var1

    s  1
a  10  0
s   9  1
d   8  2
f   7  3
g   6  4

In [17]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6],'d':[1,2,3,4,5], 1: [0,1,2,3,4]}

var1=pd.DataFrame(d)

var1

   a   s  d  1
0  1  10  1  0
1  2   9  2  1
2  3   8  3  2
3  4   7  4  3
4  5   6  5  4

In [18]:
d={'a':[1,2,3,4,5], 's':[10,9,8,7,6],'d':[1,2,3,4,5], 1: [0,1,2,3,4]}

var1=pd.DataFrame(d)

var1['a'][3]  # colmn is a and index is 3

4

In [19]:
list_1=[[1,2,3,4,5],[11,12,13,14,15]]
var2=pd.DataFrame(list_1)

var2

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

In [21]:
sr= {'s': pd.Series([1,2,3,4]), 'r': pd.Series([5,6,7,8,9])}
var3=pd.DataFrame(sr)
var3

     s  r
0  1.0  5
1  2.0  6
2  3.0  7
3  4.0  8
4  NaN  9